@javascript
Feature: 业务确认退款诉求
         为了保证退款的有效性，需要业务人员进行删券，确认返利，确认退款金额等操作。
       Background:
         Given 有下面的用户users:
          | name    | role | password |
          | yewu001 | yewu | 123456   |
          | yewu002 | yewu | 123456   |
          | caiwu001| caiwu| 123456   |
          | caiwu002| caiwu| 123456   |

       Scenario:快递退款，全退，无返利
          Given 有一项"快递"退款，支付编号是"ft-001"，订单单价是"2.0"，订单数量是"8"，退单数量是"8"，返利是"0"
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-001"的退款诉求进行业务"操作"
          And 我看到退款金額是"16.0"，返还余額是"0.0"
          And 我选择财务"caiwu002"
          When 我点击"业务确认"
          Then 退款诉求"ft-001"的业务人是"yewu001"，财务人是"caiwu002"，业务退款金額是"16.0"， 需要返还的余額是"0.0"
       Scenario:快递退款，部分退，无返利
          Given 有一项"快递"退款，支付编号是"ft-002"，订单单价是"2.0"，订单数量是"8"，退单数量是"6"，返利是"0"
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-002"的退款诉求进行业务"操作"
          And 我看到退款金額是"12.0"，返还余額是"0.0"
          And 我选择财务"caiwu001"
          When 我点击"业务确认"
          Then 退款诉求"ft-002"的业务人是"yewu001"，财务人是"caiwu001"，业务退款金額是"12.0"， 需要返还的余額是"0.0"
       Scenario:快递退款，全退，全額返利
          Given 有一项"快递"退款，支付编号是"ft-003"，订单单价是"8.0"，订单数量是"10"，退单数量是"10"，返利是"8.0"
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-003"的退款诉求进行业务"操作"
          And 我看到退款金額是"72.0"，返还余額是"8.0"
          And 我选择财务"caiwu001"
          When 我点击"业务确认"
          Then 退款诉求"ft-003"的业务人是"yewu001"，财务人是"caiwu001"，业务退款金額是"72.0"， 需要返还的余額是"8.0"
       Scenario:快递退款，部分退，部分返利
          Given 有一项"快递"退款，支付编号是"ft-004"，订单单价是"8.0"，订单数量是"10"，退单数量是"5"，返利是"8.0"
          When 我用"yewu002"的帐号登录到饭后
          Then 我对支付编号为"ft-004"的退款诉求进行业务"操作"
          And 我看到退款金額是"36.0"，返还余額是"4.0"
          And 我选择财务"caiwu002"
          When 我点击"业务确认"
          Then 退款诉求"ft-004"的业务人是"yewu002"，财务人是"caiwu002"，业务退款金額是"36.0"， 需要返还的余額是"4.0"

       Scenario:饭团券退款，全退，无返利
          Given 有一项"券"退款，支付编号是"ft-005"，订单单价是"8.0"，订单数量是"10"，退单数量是"10"，返利是"0.0"
          And 订单"ft-005"有下面的券:
          |no |
          |c1 |
          |c2 |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          |c8 |
          |c9 |
          |c10|
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-005"的退款诉求进行业务"操作"
          And 我看到"10"张需要删除的券
          When 我删除"10"张券
          Then 我看到退款金額是"80.0"，返还余額是"0.0"
          And 我选择财务"caiwu001"
          When 我点击"业务确认"
          Then 退款诉求"ft-005"的业务人是"yewu001"，财务人是"caiwu001"，业务退款金額是"80.0"， 需要返还的余額是"0.0"

       Scenario:饭团券退款，部分退，无返利
          Given 有一项"券"退款，支付编号是"ft-006"，订单单价是"8.0"，订单数量是"7"，退单数量是"5"，返利是"0.0"
          And 订单"ft-006"有下面的券:
          |no |
          |c1 |
          |c2 |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          And 订单"ft-006"要退下面的券:
          |no |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-006"的退款诉求进行业务"操作"
          And  我只看到下面的券需要删除:
          |no |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          When 我删除下面的券:
          |no |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          Then 我看到退款金額是"40.0"，返还余額是"0.0"
          And 我选择财务"caiwu002"
          When 我点击"业务确认"
          Then 退款诉求"ft-006"的业务人是"yewu001"，财务人是"caiwu002"，业务退款金額是"40.0"， 需要返还的余額是"0.0"

       Scenario:饭团券退款，全退， 全額返利
          Given 有一项"券"退款，支付编号是"ft-007"，订单单价是"8.0"，订单数量是"3"，退单数量是"3"，返利是"5.0"
          And 订单"ft-007"有下面的券:
          |no |
          |c2 |
          |c3 |
          |c4 |
          When 我用"yewu001"的帐号登录到饭后
          Then 我对支付编号为"ft-007"的退款诉求进行业务"操作"
          And 我看到"3"张需要删除的券
          When 我删除"3"张券
          Then 我看到退款金額是"19.0"，返还余額是"5.0"
          And 我选择财务"caiwu001"
          When 我点击"业务确认"
          Then 退款诉求"ft-007"的业务人是"yewu001"，财务人是"caiwu001"，业务退款金額是"19.0"， 需要返还的余額是"5.0"

       Scenario:饭团券退款，部分退， 部分返利
       Given 有一项"券"退款，支付编号是"ft-008"，订单单价是"9.0"，订单数量是"6"，退单数量是"2"，返利是"7.0"
          And 订单"ft-008"有下面的券:
          |no |
          |c2 |
          |c3 |
          |c4 |
          |c5 |
          |c6 |
          |c7 |
          When 我用"yewu002"的帐号登录到饭后
          Then 我对支付编号为"ft-008"的退款诉求进行业务"操作"

          When 我删除"2"张券
          Then 我看到退款金額是"16.0"，返还余額是"2.0"
          And 我选择财务"caiwu001"
          When 我点击"业务确认"
          Then 退款诉求"ft-008"的业务人是"yewu002"，财务人是"caiwu001"，业务退款金額是"16.0"， 需要返还的余額是"2.0"
